CREATE TABLE `PRODUCT_CATEGORY`
(
    `CATEGORY_CODE`	MEDIUMINT NOT NULL AUTO_INCREMENT COMMENT '제품분류코드',
    `CATEGORY_NAME`	VARCHAR(100) NOT NULL COMMENT '제품분류명',
    PRIMARY KEY ( `CATEGORY_CODE`)
)
    COMMENT = '제품분류';

CREATE TABLE `PRODUCT_INFO`
(
    `PRODUCT_CODE`		MEDIUMINT NOT NULL AUTO_INCREMENT COMMENT '제품코드',
    `PRODUCT_NAME`		VARCHAR(50) NOT NULL COMMENT '제품명',
    `ORIGIN_COST`		VARCHAR(10) NOT NULL COMMENT '원가',
    `RELEASE_DATE`		VARCHAR(8) NOT NULL COMMENT '출시일',
    `DISCOUNT_RATE`		VARCHAR(3) COMMENT '할인product_categoryproduct_category율',
    `SALES_QUANTITY`	VARCHAR(15) NOT NULL COMMENT '판매량',
    `STOCK_QUANTITY`    VARCHAR(15) NOT NULL COMMENT '재고량',
    `CATEGORY_CODE`		VARCHAR(5) NOT NULL COMMENT '제품분류코드',
    `PRODUCTION_STATUS`	VARCHAR(1) NOT NULL COMMENT '생산상태',
    PRIMARY KEY ( `PRODUCT_CODE` )
)
    COMMENT = '제품정보';


INSERT INTO PRODUCT_CATEGORY (CATEGORY_NAME) VALUES
                                                 ('소형가전'),
                                                 ('일회용품'),
                                                 ('다회용기'),
                                                 ('소품'),
                                                 ('주방제품');

INSERT INTO PRODUCT_INFO (PRODUCT_NAME, ORIGIN_COST, RELEASE_DATE, DISCOUNT_RATE, SALES_QUANTITY, STOCK_QUANTITY, CATEGORY_CODE, PRODUCTION_STATUS)
VALUES
('남이쓴드라이어','675000','20230122','0','672','248',1,'Y'),
('갈아먹는핸드믹서','32000','20230117','10','31020','103',1,'N'),
('쫙쫙아이롱','57200','20230122','0','3312','11',1,'Y'),
('요란한탁상시계','11700','20230119','55','71','154',1,'Y'),
('1초만에충전기','99780','20230610','0','0','200000',1,'Y'),
('엔스타감성무드등','127500','20230507','0','945127','1567',1,'R'),
('테라바이트USB','78000','20230311','2','1543','67',1,'Y'),
('미키닮은마우스','41000','20230315','4','5412','148',1,'Y'),
('하늘하늘티슈','1400','20230511','10','354187','1354',2,'Y'),
('한지컵','3000','20230511','10','1573','34138',2,'Y'),
('옥수수수염빨대','2700','20230630','0','0','300000',2,'H'),
('신문지빨대','3100','20230401','30','1573','8354154',2,'Y'),
('대나무젓가락','14500','20230228','1','1801','132',2,'Y'),
('락큰롤밀폐용기','7770','20230405','0','17054','37',3,'Y'),
('폭포수텀블러','18900','20230810','0','0','7000',3,'Y'),
('파도속유리병','20100','20230505','0','15437','802',3,'Y'),
('까딱까딱차량인형','18000','20230210','10','7124','10',4,'Y'),
('단짠단짠방향제','32000','20230210','20','315','203',4,'Y'),
('한입만숟가락','3700','20230401','5','1751','201',5,'Y'),
('깨작깨작젓가락','5200','20230401','5','3700','147',5,'Y'),
('대리석접시','89700','20230401','0','2072157','14',5,'Y'),
('나뭇가지냄비받침','5100','20230514','1','149','315',5,'Y'),
('섬섬옥수고무장갑','61000','20230510','17','81347','2312',5,'H'),
('주스담는와인잔','170900','20230627','0','0','1000000',5,'N'),
('대리석밥그릇','312000','20230530','0','0','300000',5,'Y'),
('대리석국그릇','405000','20230530','0','0','300000',5,'Y'),
('3L간장종지','8600','20230702','0','357','34',5,'Y'),
('뒤집어지는프라이팬','75000','20230314','3','235123','3254',5,'Y');


commit;